benchmark/results/wrk-gogo-multi.log
== gogo [multi] /hello  t=1 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  164.77us   8.72ms   96.09%
    Req/Sec   273.66k    14.03k  297.22k    89.33%
  Latency Distribution
     50%    0.92ms
     75%    0.96ms
     90%    1.01ms
     99%    1.38ms
  4083724 requests in 15.00s, 568.60MB read
Requests/sec: 272167.27
Transfer/sec:     37.90MB
== gogo [multi] /hello  t=2 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.73ms    1.19ms  36.00ms   95.57%
    Req/Sec   145.54k    12.00k  164.35k    75.33%
  Latency Distribution
     50%    1.59ms
     75%    1.66ms
     90%    1.81ms
     99%    3.35ms
  4355907 requests in 15.05s, 606.50MB read
Requests/sec: 289349.98
Transfer/sec:     40.29MB
== gogo [multi] /hello  t=4 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76ms  350.99us  13.23ms   91.26%
    Req/Sec    70.31k     5.58k   78.33k    73.67%
  Latency Distribution
     50%    1.68ms
     75%    1.76ms
     90%    1.95ms
     99%    3.35ms
  4197723 requests in 15.00s, 584.48MB read
Requests/sec: 279765.80
Transfer/sec:     38.95MB
== gogo [multi] /hello  t=8 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85ms    1.18ms  37.67ms   97.68%
    Req/Sec    34.41k     2.96k   41.86k    89.42%
  Latency Distribution
     50%    1.71ms
     75%    1.79ms
     90%    1.96ms
     99%    3.62ms
  4112488 requests in 15.02s, 572.61MB read
Requests/sec: 273755.12
Transfer/sec:     38.12MB
== gogo [multi] /hello/inon  t=1 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms    1.57ms  56.95ms   98.90%
    Req/Sec   256.36k    28.19k  274.58k    88.00%
  Latency Distribution
     50%    0.96ms
     75%    1.01ms
     90%    1.20ms
     99%    2.89ms
  3831677 requests in 15.04s, 529.85MB read
Requests/sec: 254828.47
Transfer/sec:     35.24MB
== gogo [multi] /hello/inon  t=2 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello/inon
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77ms  336.27us  13.49ms   93.26%
    Req/Sec   139.20k     8.09k  153.49k    85.76%
  Latency Distribution
     50%    1.72ms
     75%    1.79ms
     90%    1.88ms
     99%    3.40ms
  4181691 requests in 15.10s, 578.26MB read
Requests/sec: 276883.93
Transfer/sec:     38.29MB
== gogo [multi] /hello/inon  t=4 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.88ms    1.13ms  41.58ms   97.96%
    Req/Sec    67.54k     5.36k   72.97k    88.67%
  Latency Distribution
     50%    1.77ms
     75%    1.84ms
     90%    1.98ms
     99%    3.52ms
  4032043 requests in 15.00s, 557.56MB read
Requests/sec: 268718.87
Transfer/sec:     37.16MB
== gogo [multi] /hello/inon  t=8 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/hello/inon
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms  812.48us  37.12ms   97.76%
    Req/Sec    33.68k     2.27k   42.55k    89.17%
  Latency Distribution
     50%    1.77ms
     75%    1.84ms
     90%    1.95ms
     99%    3.50ms
  4023309 requests in 15.02s, 556.35MB read
Requests/sec: 267921.22
Transfer/sec:     37.05MB
== gogo [multi] /db  t=1 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.41ms  661.11us  80.33ms   90.37%
    Req/Sec   195.91k    15.74k  209.53k    88.74%
  Latency Distribution
     50%    2.35ms
     75%    2.53ms
     90%    2.73ms
     99%    5.15ms
  2943452 requests in 15.10s, 554.90MB read
Requests/sec: 194868.63
Transfer/sec:     36.74MB
== gogo [multi] /db  t=2 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/db
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.71ms    1.41ms 126.38ms   93.11%
    Req/Sec    90.38k    12.25k  106.93k    78.33%
  Latency Distribution
     50%    2.47ms
     75%    2.73ms
     90%    3.50ms
     99%    7.27ms
  2699455 requests in 15.01s, 508.91MB read
Requests/sec: 179822.40
Transfer/sec:     33.90MB
== gogo [multi] /db  t=4 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.74ms    1.63ms 129.50ms   96.11%
    Req/Sec    45.82k     5.03k   55.78k    84.33%
  Latency Distribution
     50%    2.51ms
     75%    2.71ms
     90%    3.16ms
     99%    7.56ms
  2736015 requests in 15.01s, 515.80MB read
Requests/sec: 182309.29
Transfer/sec:     34.37MB
== gogo [multi] /db  t=8 c=500 d=15s ==
Running 15s test @ http://127.0.0.1:3002/db
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.03ms    1.95ms 137.21ms   92.73%
    Req/Sec    20.96k     2.98k   37.56k    71.67%
  Latency Distribution
     50%    2.60ms
     75%    2.95ms
     90%    4.32ms
     99%    9.75ms
  2502851 requests in 15.02s, 471.84MB read
Requests/sec: 166631.71
Transfer/sec:     31.41MB